{
	"About": {
		"title": "Little about me",
		"p1": "Hello :) My name is Antoine and I take joy in creating content for myself as a hobby. I never worked for a client independantly but I am looking fourth to that day. Anyways, I'm 29 years old, based in Montreal, Canada (yes I speak french). I was very into sports when I was still in school. So much that I tried to become pro. However, it took me quite some time to understand that I wanted to dedicate my life to become more entrepeneurial.",
		"p2": "I took an interest in web development during one of my internship and here I am today, still loving it. I currently work at",
		"p3": "as a frontend developer. I am constantly challenged with new constraints weekly and I take pride and joy intothe work I'm doing.",
		"p4": "My end goal is a mansion and soccer field in my backyard, and that day will comes with effort. But don't worry, I am very down to earth and enjoying the process to that mountain."
	},
	"Home": {
		"Hello, I am": "Hello, I am",
		"Web designer": "Web designer",
		"Full stack dev": "Full stack dev",
		"Content creator": "Content creator",
		"Portfolio designer": "Portfolio designer",
		"Antoine Hakim": "Antoine Hakim"
	},
	"Introduction": {
		"hi": "Hi,",
		"intro": "Hi, my name is",
		"name": "Antoine Hakim.",
		"jobTitle": "Web developer, based in Montreal",
		"summary": "I'm a full-stack developer with a background experience in building full-fledged custom platform, tailed to customers needs. My past accomplishments holds in the companies I've worked for, but right now, I am looking and hoping to connect with people and work together to design amazing content. If you have a project and would love to bring it to reality, I am your man for the job."
	},
	"Navbar": {
		"About": "About",
		"Job history": "Job history",
		"Projects": "Projects",
		"Services": "Services",
		"Download": "Resume",
		"Filename": "CV_Antoine_Hakim_En"
	},
	"Services": {
		"Services": "Services",
		"Starting price": "Starting price",
		"What's included": "What's included",
		"Design": {
			"title": "Design",
			"a": "A figma design with of how your website will look like",
			"b": "Unlimited calls to go over your design",
			"c": "Fully responsive design",
			"d": "Fully interactable design"
		},
		"SinglePage": {
			"title": "One page",
			"a": "A portoflio to showcase your work projects",
			"b": "A blog page that will allow you to post content about your favorite subjects",
			"c": "A restaurant website with an integrated menu",
			"d": "An event promoting website to market yourself",
			"e": "Promote your business by building an online presence"
		},
		"Custom": {
			"title": "Custom made",
			"a": "Unique design that will represent your brand identity and goal",
			"b": "Tailored functionalities to your needs",
			"c": "Scalable to support large amounts of request activities. This is crucial for business, allowing them to evolve with the growing number of users",
			"d": "Great performance, depending on the framework selection and how the code is written can often increase loading speed of your website",
			"e": "Search Engine Optimization (SEO) can allow your website to appear in the first tier lists of a search engine",
			"f": "Security is key if your website holds very sensitive information, protecting yourself and your users against any data breaches"
		},
		"Inquire": "Inquire"
	},
	"Resume": {
		"Resume": "Resume",
		"Projects": "Projects",
		"Personal projects": "Personal projects",
		"Custom website": "Custom website",
		"Portfolio": "Portfolio",
		"Service": "Service",
		"E commerce website": "E commerce website",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Experienced full-stack engineer focused on building accessible & custom experience",
		"Relevant Experience": "Relevant Experience",
		"Skills": "Skills",
		"Software Engineering": "Software Engineering",
		"Computer Science (Certificate)": "Computer Science (Certificate)",
		"Computer Science & technology": "Computer Science & technology",
		"Bachelor of software engineering": "Bachelor of software engineering",
		"Programming languages": "Programming languages",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Tools & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Rest API application",
		"Selected Projects": "Selected Projects",
		"Education": "Education",
		"Interests": "Interests",
		"Job History": "Job History",
		"Work experience": "Work experience",
		"Senior Frontend Engineer": "Senior Frontend Engineer",
		"Fullstack engineer": "Fullstack engineer",
		"Intern Frontend developer": "Intern Frontend developer",
		"Full resume": "Full resume",
		"My information": "My information",
		"Soccer": "Soccer",
		"Hiking": "Hiking",
		"Climbing": "Climbing",
		"Web development": "Web development",
		"Axe throwing": "Axe throwing",
		"GoTo": {
			"summary": "I contribute to the development of a top-notch SaaS business communication tool, focusing on customer-facing features. My work ensures the platform remains high quality and robust, delivering a seamless experience for users.",
			"a": "Developed a high-end business communication settings tool using ReactJS, Redux-Thunk, React-Router, Javascript, Typescript, HTML5, CSS3, and MUI5",
			"b": "Built and managed custom components for internal libraries, including custom Formik input/select/radio fields",
			"c": "Exclusively used React-Hooks to handle application life-cycle processes",
			"d": "Collaborated with the UI/UX team to establish specifications and system designs",
			"e": "Worked in Agile Methodologies for iterative development to consistently deliver a better application",
			"f": "Possesses strong expertise in Github (formerly used Bitbucket) as the main version control service",
			"g": "Created features/sections/subsections for the new web app (coded in React) using a micro frontend approach",
			"h": "Developed features that facilitated a smooth transition for 90% of clients using the legacy platform web app to the more modern web app, resulting in a significantly improved user experience"
		},
		"Desjardins": {
			"summary": "Contributed to the development of a secured messaging platform for internal use with outside customer, where both parties can share documents, send and receive messages alongside other features. Working there also gave me hands-on experience with security management since it was a bank, and information is extremely sensitive. The backend worked as a microservice approach and I was responsible for one of them, therefore I learned to develop a REST backend with SpringBoot and a lot of experience with pipeline deployment.",
			"a": "Led the development and introduced rigorous coding standards for our frontend application in Typescript using StencilJS",
			"b": "Developed a frontend service from scratch using AngularJS, StencilJS, Typescript, HTML5, and CSS/SCSS",
			"c": "Helped develop a RESTful service from scratch, using a microservices approach for better performance with the help of SpringBoot and libraries such as PKCE for secure authentication",
			"d": "Configured Concourse/CI automated pipelines that would fetch a project, build, run unit tests, run smoke tests, and deploy to multiple environments (dev, stage and production)",
			"e": "Developed unit tests using JUnit5 and JaCoCo for Spring Boot, and Jest for Stencil",
			"f": "Connected our repositories to our dedicated SonarQube server, and added an 80% coverage test with 5% duplication thresholds for success (on both backend and frontend)"
		},
		"Bell": {
			"summary": "Led the development of a fully functional JIRA-like dashboard helping internal employees with their morning stand-ups. My work impacted their schedules and allowed them to be 70% more productive everyday. I took charge in setting up the code structure and using what I had at the time, very small knowledge of EmberJS. I also had the chance to work on the REST backend which was developed in C#.",
			"a": "Built a fully functional JIRA-like dashboard for internal teams to use at standups from scratch using EmberJS, and the Ember Octane framework, along with HTML, JavaScript, and CSS",
			"b": "Introduced a solid structured code design that creates reusable modular components across the app",
			"c": "Mentored interns on the use of EmberJS",
			"d": "Worked with the backend team to develop endpoints for specific use cases required by the clients using C# with some well-known design patterns such as OOP and Polymorphism",
			"e": "Followed agile development practices and used Bitbucket/JIRA for bug tracking"
		},
		"Ubisoft": {
			"summary": "Ubisoft is where I discovered my love for web development. During my internship, I was working for a team that was developing widgets for a User dashboard. I managed to develop a widget that was an IFrame, allowing a virtual external website to load into the dashboard, with an event management system. This allowed events to travel between the current page context and the web frame.",
			"a": "Built a fully functional JIRA-like dashboard for internal teams to use at standups from scratch using EmberJS, and the Ember Octane framework, along with HTML, JavaScript, and CSS",
			"b": "Introduced a solid structured code design that creates reusable modular components across the app",
			"c": "Mentored interns on the use of EmberJS",
			"d": "Worked with the backend team to develop endpoints for specific use cases required by the clients using C# with some well-known design patterns such as OOP and Polymorphism",
			"e": "Followed agile development practices and used Bitbucket/JIRA for bug tracking"
		},
		"Discord": {
			"summary": "I developed a discord bot with a music queue functionality, for my friends and I.",
			"a": "Developed a Discord Bot that plays music for my group of friends using NodeJS, incorporating a custom-made queue system with features like previous, pause, play, and next. This implementation utilized prebuilt libraries such as Discord.js 13 and ytdl for playing Youtube music",
			"b": "Configured an EC2 server instance to host my Discord bot using a prebuilt library package called pm2, which effectively runs Node projects as processes, enabling the bot to operate 24/7",
			"c": "Pursued Ansible and Terraform as hobbies to acquire automation skills, successfully automating the process of setting up an EC2 server with all the necessary packages to run the Discord bot",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside is an app that is still in development. It aims to be a platform where people can plan sporting events on outdoor/indoor fields, find teams and groups to play with.",
			"a": "Developed a sporting event manager web app that allows users to plan outdoor activities related to sports using ReactJS, Redux-Thunk, TailwindCSS, and HTML",
			"b": "Created a RESTful service backend using NodeJS/ExpressJS and Mongoose, which connects to a MongoDB server for data storage",
			"c": "Implemented an authentication system with the help of the JWT library, allowing users to connect to the backend with an accessToken (currently lasting 1 minute) and a refreshToken",
			"d": "Integrated a Swagger server to host the same endpoint for documentation purposes",
			"e": "Implemented a Google login authentication option, allowing users to connect with their Google accounts",
			"f": "Created custom-made reusable components such as TextField, Accordion, Stepper, Toast, Calendar, and Timepicker",
			"g": "Exclusively utilized React-Hooks to handle application life-cycle processes",
			"h": "Developed custom middlewares to intercept dispatches and execute some logic",
			"i": "Utilized Google's Places library to connect a map and search for locations",
			"j": "Used HTML's native geolocating function to ask for the user's location, so the map centers and zooms in on their area upon loading",
			"k": "Implemented a language switcher and a theme switcher",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "First version of my personal portfolio developed in React without typescript.",
			"a": "Developed a portfolio/profile website with no backend, utilizing React 18 and TailwindCSS",
			"b": "Designed and implemented custom-made components such as Dialogs, Buttons, LanguageSwitchers, and Spinners",
			"c": "Implemented a small contact form that allows visitors to reach out via Email using the EmailJS library",
			"d": "Integrated a language switcher (FR, EN) using i18next for improved user experience",
			"e": "Implemeted a PDF download option for my curriculum that supports both languages",
			"f": "Set up an S3 bucket to statically host this project under a purchased domain, ensuring secure HTTPS protocol",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "This is a second version of my portfolio developed with NextJS with typescript.",
			"a": "Developed a portfolio/profile website with no backend, utilizing React 18 and TailwindCSS",
			"b": "Designed and implemented custom-made components such as Dialogs, Buttons, LanguageSwitchers, and Spinners",
			"c": "Implemented a small contact form that allows visitors to reach out via Email using the EmailJS library",
			"d": "Integrated a language switcher (FR, EN) using i18next for improved user experience",
			"e": "Implemeted a PDF download option for my curriculum that supports both languages",
			"f": "Set up an S3 bucket to statically host this project under a purchased domain, ensuring secure HTTPS protocol",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "This project is my first ever introduction to React. It was supposed to be an online store with for selling merchandise but the project never finished.",
			"a": "Developed a very small E-Commerce website as a project for friends, although it was never completed. The development involved using React, Redux-Thunk, HTML, CSS, and SCSS",
			"b": "Implemented a fully functional cart system, a basic login system, and a semi-functional PayPal integration for processing payments",
			"c": "Created a backend REST service that seamlessly connects to a SQL database system",
			"d": "Set up migration files to facilitate data initialization during fresh runs, specifically for development purposes",
			"repo": "https://github.com/Sadboiss"
		}
	}
}
