{
	"About": {
		"title": "Little about me",
		"p1": "I'm a software engineer based in Montreal with a passion for solving real-life problems through coding. After briefly pursuing a career in soccer, I realized coding was my true calling. Now, as a full stack engineer at GoTo, I face new challenges daily, and continue working on personal projects in my free time. My competitive mindset, honed from sports, drives my work ethic and passion for development."
	},
	"Introduction": {
		"Web developer, based in Montreal": "Senior Engineer, based in Montreal",
		"I'm a full-stack developer with background experience in building complex platforms and design": "I'm a fullstack developer with background experience in building complex platforms and designs."
	},
	"Index": {
		"About me": "About me",
		"Career timeline": "Career timeline",
		"Projects": "Projects",
		"Skillsets": "Skillsets",
		"Contact": "Contact",
		"Services": "Services"
	},
	"Navbar": {
		"About": "About",
		"Career": "Career",
		"Projects": "Projects",
		"Skillsets": "Skillsets",
		"Contact": "Contact",
		"Download resume": "Download resume",
		"Blog": "Blog"
	},
	"Blog": {
		"Blog": "Blog",
		"Latest Posts": "Latest Posts",
		"explore": "Explore my thoughts, tutorials, and insights",
		"searchPlaceholder": "Search blogs",
		"All Categories": "All Categories",
		"All Tags": "All Tags",
		"noResults": "No blogs found matching your criteria",
		"Blog post not found": "Blog post not found",
		"Return to blog": "Return to blog",
		"Back to blog": "Back to blog"
	},
	"Skills": {
		"title": "Skillsets",
		"Soft": {
			"title": "My soft skills",
			"adaptability": "Quickly adjust to new situations or requirements",
			"communication": "Express ideas clearly and effectively",
			"learning": "Hungry for new knowledge and skills",
			"problemSolving": "Identify and resolve complex issues efficiently",
			"resilience": "Very good at motivating myself because I take joy in coding",
			"teamwork": "Collaborate effectively with others towards common goals"
		},
		"Cloud": {
			"title": "Infrastructure stack",
			"tools": "Used Terraform and Ansible in some projects I run (mostly pickside)",
			"aws": "AWS -> Knows a lot about EC2, ECS, ECR and many more...",
			"google": "GC -> GCC & GCR",
			"experience": "Always trying different tools, and compare cost & services between them",
			"challenges": "Understand cloud cost challenges and always looking for the best way to minimize cost on services"
		},
		"Dev": {
			"title": "Software stack",
			"authentication": "Built my own authentication server for my pickside app project. Great way to learn how it's done.",
			"stack": "I use Go and React/Tailwind/CSS everyday. Also learning C in my free time.",
			"docker": "I use Docker every day for local development + as a deployment tool.",
			"versionning": "I use Git everyday and Github for versionning my projects."
		},
		"Devops": {
			"title": "Devops knowledge",
			"integration": "Worked in several multi-system integration environments",
			"microservices": "Know how to work in a microservice driven project",
			"automation": "Know how to automate a development process using tools like Github actions, Jenkins or Concourse",
			"security": "Understand the importance of security practices such as using a vault storing secrets",
			"commits": "Use semantic commits when coding, drafts release every functionning version",
			"scripts": "Program small scripts that help me in my automation process such as upgrading & commiting a new version for a microservice",
			"containerize": "Containerize my services for easy deployment"
		}
	},
	"Contact": {
		"title": "Contact",
		"Description": "If you are looking for someone to work with or even just to discuss, please feel free to contact me.",
		"Send me an email": "Send me an email"
	},
	"Services": {
		"Starting from": "Starting from {price}$",
		"Design": {
			"title": "Design",
			"a": "A figma design with of how your website will look like",
			"b": "Unlimited calls to go over your design",
			"c": "Fully responsive design",
			"d": "Fully interactable design"
		},
		"SinglePage": {
			"title": "One page",
			"a": "Could be a portfolio to showcase your skills",
			"b": "Could be a blog page that will allow you to post content about your favorite subjects",
			"c": "Could be a restaurant menu",
			"d": "Could be an event promotion website"
		},
		"Custom": {
			"title": "Custom",
			"a": "Unique design",
			"b": "Tailored to your needs & vision",
			"c": "Scalable",
			"d": "Optimized",
			"e": "Will include SEO (Search engine Optimization) to index your website amongst the first results"
		},
		"Inquire": "Inquire"
	},
	"Resume": {
		"View resume": "View resume",
		"Download resume": "Download resume",
		"Resume": "Resume",
		"Frontend": "Frontend",
		"Backend": "Backend",
		"Cloud/DevOps": "Cloud/DevOps",
		"Projects": "Projects",
		"Portfolios": "Portfolios",
		"Personal Projects": "Personal Projects",
		"Custom website": "Custom website",
		"Portfolio": "Portfolio",
		"Service": "Service",
		"E commerce website": "E commerce website",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Senior software engineer",
		"Relevant Experience": "Relevant Experience",
		"Skills": "Skills",
		"Software Engineering": "Software Engineering",
		"Computer Science (Certificate)": "Computer Science (Certificate)",
		"Computer Science & technology": "Computer Science & technology",
		"Bachelor of software engineering": "Bachelor of software engineering",
		"Programming languages": "Programming languages",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Tools & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Rest API application",
		"Selected Projects": "Selected Projects",
		"Education": "Education",
		"Interests": "Interests",
		"Job History": "Job History",
		"Work experience": "Work experience",
		"Software engineer": "Software engineer",
		"Software engineer (Intern)": "Software engineer (Intern)",
		"Senior frontend engineer": "Senior frontend engineer",
		"Fullstack engineer": "Fullstack engineer",
		"Intern frontend engineer": "Intern frontend engineer",
		"Full resume": "Full resume",
		"My information": "My information",
		"Soccer": "Soccer",
		"Hiking": "Hiking",
		"Climbing": "Climbing",
		"Web development": "Web development",
		"Axe throwing": "Axe throwing",
		"Senior software engineer": "Senior software engineer",
		"Selected projects": "Selected projects",
		"Summary": "Software Engineer with 5+ years of end-to-end platform development experience, delivering high-impact solutions across fintech, enterprise software, telecom, and gaming. Skilled at modernizing legacy systems, building secure and scalable platforms, and ensuring clear, future-proof documentation to support long-term growth.",
		"GoTo": {
			"summary": "I focus on building and enhancing a SaaS business platform, ensuring it's reliable, user-friendly, and equipped with features that add real value.",
			"a": "Owned the user management sections on the admin dashboard, enabled 95% of legacy clients to transition smoothly to the new platform",
			"b": "Collaborated with product and UX teams to design flexible, role-based user flows, reducing onboarding-related support requests by 30% across all newly onboarded accounts",
			"c": "Re-architected the privilege system, transitioning to an RBAC model, improving access reliability, and reducing privilege-related support incidents by 40%",
			"d": "Developed billing administrator features, enabling client transitions and eliminating manual reconciliation work",
			"e": "Refactored product settings into reusable, modular components, reducing code duplication across 20+ files, accelerating new feature delivery by 25%",
			"f": "Mentored 2 junior devs, accelerating their onboarding by 50%."
		},
		"Desjardins": {
			"summary": "Worked on a secure messaging platform where users could share sensitive documents and messages. Learned a ton about security and building microservices, especially how to make solid REST APIs and pipelines.",
			"a": "Built a secure file-sharing platform from scratch for financial advisors to request and receive confidential documents from clients, supporting advisors across 40+ branches",
			"b": "Owned a security-focused microservice, implementing PKCE-based authentication and XSS defenses, enabling secure document submissions for 100+ advisors and clients weekly in a highly regulated environment",
			"c": "Led the emergency response to Log4j vulnerability, updating the version within 48 hours to avoid potential security breaches",
			"d": "Built and published a reusable component library, cutting boilerplate across 20+ teams and accelerating frontend development",
			"e": "Implemented CI/CD pipelines with 80%+ test coverage, reducing deployment-related incidents by 50%"
		},
		"Bell": {
			"summary": "Helped build an internal dashboard (think JIRA-lite) that made team stand-ups way easier and saved them a ton of time. I also got to work on both the frontend and backend, which was a great learning experience.",
			"a": "Built and owned the frontend for an internal swimlane board, replacing manual whiteboard planning for 50+ teams and reducing daily scheduling time by 15 minutes per team",
			"b": "Built full-stack task management features, integrating frontend interactions (drag-and-drop, color-tagging, search) with backend CRUD endpoints for seamless task management",
			"c": "Mentored teammates in EmberJS, improving team productivity and technical expertise",
			"d": "Created an interactive onboarding guide, accelerating new user adoption and reducing onboarding time by half"
		},
		"Ubisoft": {
			"summary": "This was my first job as an intern, where I fell in love with frontend dev. I built widgets with PolymerJS (a Google library) and learned the ropes of component-based design.",
			"a": "Built and deployed event-based communication channel for drag-and-drop iFrame widgets, enabling seamless cross-widget data exchange within the dashboard using PolymerJS and TypeScript",
			"b": "Designed and implemented unit tests for iFrame widgets, focusing on event-handling edge cases, and collaborated with QA to design cross-widget integration tests ensuring reliable communication across all dashboard components"
		},
		"Discord": {
			"summary": "Built a Discord bot with music queue functionality to make things more fun for my friends and me.",
			"a": "Developed a bot using Python and NodeJS, featuring a custom queue system with controls for play, pause, next, and previous",
			"b": "Set up hosting on an EC2 instance with pm2 to ensure the bot runs 24/7 without interruptions",
			"c": "Automated the EC2 setup with Ansible and Terraform, saving time and streamlining deployments",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside is a platform in development for planning sports events, finding teams, and managing venues.",
			"summarywithstack": "Pickside: Event planning app – Built with React, Golang, Docker, AWS, and a home server for hosting and CI/CD",
			"a": "Founded and built a scalable event planning platform, driving product vision, architecture, and full-stack development",
			"b": "Developed core features including authentication, role-based access, event creation, and multi-user CRUD operations, applying real-world SaaS design principles",
			"c": "Built a background notification system using Goroutines, with a future roadmap to evolve into real-time event streaming",
			"d": "Architected the platform with scalability in mind, leveraging Docker-based deployment and CI/CD automation, with plans for future horizontal scaling as user demand grows",
			"e": "Managed the end-to-end product lifecycle, from feature ideation and technical design to deployment, with early-stage integration of Grafana-based logging on a home server to prototype future observability",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "My first portfolio project, built with React to showcase my skills and work.",
			"summarywithstack": "Portfolio V1 - Built with React and TailwindCSS, hosted on AWS via S3",
			"a": "Built and continuously evolved personal portfolio sites, integrating features like bilingual support, PDF resume generation, and dynamic content rendering",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "A more polished version of my portfolio, using Next.js and TypeScript for a modern look and feel.",
			"summarywithstack": "Portfolio V2 - Built with Next.js, TypeScript, and TailwindCSS, hosted on Vercel",
			"a": "Focused on performance and modern deployment by hosting on AWS S3 (V1) and Vercel (V2), ensuring seamless global access with minimal latency",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "An e-commerce store project for selling homemade t-shirts. It was never completed, but I gained valuable experience.",
			"a": "Designed a basic e-commerce site using React 16 (pre-hooks) and a C# backend",
			"b": "Implemented features like a functional cart, user login, and partial PayPal integration",
			"c": "Used a home-hosted MySQL server to manage backend data",
			"d": "Learned about database migrations to streamline development and setup processes",
			"repo": "https://github.com/Sadboiss"
		}
	}
}