{
	"About": {
		"title": "Little about me",
		"p1": "Hi there! I'm Antoine and I absolutely love creating content as a hobby. While I haven't had the chance to work independently for clients just yet, I'm really looking forward to that opportunity. I'm 29 years old and proud to call Montreal, Canada my home (and yes, I speak French!).",
		"p2": "Back in school, I was super passionate about sports and even dreamed of going pro. However, as time went on, I realized my true calling was in entrepreneurship.",
		"p3": "My journey into web development began during one of my internships, and here I am today, still completely enamored with it. Currently, I'm a frontend developer at {company}, where I face new challenges every week. I take immense pride and joy in the work I do—it's truly fulfilling!"
	},

	"Introduction": {
		"Web developer, based in Montreal": "Web developer, based in Montreal",
		"I'm a full-stack developer with background experience in building complex platforms and design": "I'm a full-stack developer with background experience in building complex platforms and design."
	},
	"Index": {
		"About me": "About me",
		"Career timeline": "Career timeline",
		"Projects": "Projects",
		"My packages": "My packages"
	},
	"Navbar": {
		"About": "About",
		"Career": "Career",
		"Projects": "Projects",
		"Services": "Services",
		"Download resume": "Download resume"
	},
	"Services": {
		"Starting from": "Starting from {price}$",
		"Design": {
			"title": "Design",
			"a": "A figma design with of how your website will look like",
			"b": "Unlimited calls to go over your design",
			"c": "Fully responsive design",
			"d": "Fully interactable design"
		},
		"SinglePage": {
			"title": "One page",
			"a": "Could be a portfolio to showcase your skills",
			"b": "Could be a blog page that will allow you to post content about your favorite subjects",
			"c": "Could be a restaurant menu",
			"d": "Could be an event promotion website"
		},
		"Custom": {
			"title": "Custom",
			"a": "Unique design",
			"b": "Tailored to your needs & vision",
			"c": "Scalable",
			"d": "Optimized",
			"e": "Will include SEO (Search engine Optimization) to index your website amongst the first results"
		},
		"Inquire": "Inquire"
	},
	"Resume": {
		"View resume": "View resume",
		"Resume": "Resume",
		"Projects": "Projects",
		"Personal projects": "Personal projects",
		"Custom website": "Custom website",
		"Portfolio": "Portfolio",
		"Service": "Service",
		"E commerce website": "E commerce website",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Experienced full-stack engineer focused on building accessible & custom experience",
		"Relevant Experience": "Relevant Experience",
		"Skills": "Skills",
		"Software Engineering": "Software Engineering",
		"Computer Science (Certificate)": "Computer Science (Certificate)",
		"Computer Science & technology": "Computer Science & technology",
		"Bachelor of software engineering": "Bachelor of software engineering",
		"Programming languages": "Programming languages",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Tools & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Rest API application",
		"Selected Projects": "Selected Projects",
		"Education": "Education",
		"Interests": "Interests",
		"Job History": "Job History",
		"Work experience": "Work experience",
		"Senior frontend engineer": "Senior frontend engineer",
		"Fullstack engineer": "Fullstack engineer",
		"Intern frontend engineer": "Intern frontend engineer",
		"Full resume": "Full resume",
		"My information": "My information",
		"Soccer": "Soccer",
		"Hiking": "Hiking",
		"Climbing": "Climbing",
		"Web development": "Web development",
		"Axe throwing": "Axe throwing",
		"Selected projects": "Selected projects",
		"GoTo": {
			"summary": "I contribute to the development of a top-notch SaaS business communication tool, focusing on customer-facing features. My work ensures the platform remains high quality and robust, delivering a seamless experience for users.",
			"a": "Developed and modified 10+ core features, helping 85% of the existing clients move away from the legacy platform of a $4B company",
			"b": "Developed 20+ reusable components",
			"c": "Took initiative to add a refactoring sprint to gradually shorten the code debt gap",
			"d": "Constantly collaborating with UI/UX team to establish specifications and system designs",
			"e": "Oversaw the review and coding standard of new features",
			"f": "Documented design workflow and technical aspects of new features, as well as tracking their progress",
			"g": "Presented and conveyed ideas and designs approach with 3+ UX partners and 2+ Manager engineers",
			"h": "Built small automated scripts to assist my feature deployment process, increasing my productivity by 10%"
		},
		"Desjardins": {
			"summary": "Contributed to the development of a secured messaging platform for internal use with outside customer, where both parties can share documents, send and receive messages alongside other features. Working there also gave me hands-on experience with security management since it was a bank, and information is extremely sensitive. The backend worked as a microservice approach and I was responsible for one of them, therefore I learned to develop a REST backend with SpringBoot and a lot of experience with pipeline deployment.",
			"a": "Led the development and introduced rigorous coding standards for the frontend application using Typescript and StencilJS",
			"b": "Developed micro-frontend services, with each 20+ custom reusable components",
			"c": "Developed one of the 3 microservices Rest APIs used for the platform's authentication service using Spring and PKCE",
			"d": "Configured a deployment pipeline for each microservice I developed, and added quality gate control with threshold of 80% test passing for the BFF",
			"e": "Developed unit tests & integration tests using JUnit5/JaCoCo for for the backend, and Jest/Puppeteer for Stencil"
		},
		"Bell": {
			"summary": "Led the development of a fully functional JIRA-like dashboard helping internal employees with their morning stand-ups. My work impacted their schedules and allowed them to be 70% more productive everyday. I took charge in setting up the code structure and using what I had at the time, very small knowledge of EmberJS. I also had the chance to work on the REST backend which was developed in C#.",
			"a": "Built a fully functional internal dashboard connected to a SAP database, helping on-site teams boost their productivity by 70% and saving them 5 hours every week",
			"b": "Introduced a solid component oriented design structure, improving the developers' efficiency to work with the code base",
			"c": "Mentored interns on and seniors on EmberJS",
			"d": "Helped optimizing a big relational database driven by a complex business logic and reduced the amount of queries needed by 2%",
			"e": "Released 30+ features following the agile development practice"
		},
		"Ubisoft": {
			"summary": "Ubisoft was my first job, as an intern and is also where I discovered my love for frontend development. I was responsible to develop some widgets with PolymerJS, a web components library developed by Google. I used my almost-to-no knowledge on component design approach (at the time) to learn a create my first widget.",
			"a": "Built a fully functional iFrame widget that can receive & send events from the dashboard it is attached to using PolymerJS and Typescript",
			"b": "Built 2+ widgets that were connected to a dashboard mostly for user metrics",
			"c": "Learned about the agile development process and put it to practice",
			"d": "Developed unit tests",
			"e": "Attended over 100+ meetings during my internship"
		},
		"Discord": {
			"summary": "I developed a discord bot with a music queue functionality, for my friends and I.",
			"a": "Developed a Discord Bot that plays music for my group of friends using NodeJS, incorporating a custom-made queue system with features like previous, pause, play, and next. This implementation utilized prebuilt libraries such as Discord.js 13 and ytdl for playing Youtube music",
			"b": "Configured an EC2 server instance to host my Discord bot using a prebuilt library package called pm2, which effectively runs Node projects as processes, enabling the bot to operate 24/7",
			"c": "Pursued Ansible and Terraform as hobbies to acquire automation skills, successfully automating the process of setting up an EC2 server with all the necessary packages to run the Discord bot",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside is an app that is still in development. It aims to be a platform where people can plan sporting events on outdoor/indoor fields, find teams and groups to play with.",
			"a": "Developed a sporting event manager web app that allows users to plan outdoor activities related to sports using ReactJS, Redux-Thunk, TailwindCSS, and HTML",
			"b": "Created a RESTful service backend using NodeJS/ExpressJS and Mongoose, which connects to a MongoDB server for data storage",
			"c": "Implemented my own authentication process as a way to learn the process, also supporting Google authentication",
			"d": "Integrated a Swagger endpoint for documentation purposes",
			"e": "Created a messaging system using websockets",
			"f": "Created over 30+ reusable components",
			"g": "Created over 20+ react custom hooks",
			"h": "Using no third party library other than Tailwind for CSS",
			"i": "Utilized Google's Places library to connect a map and search for locations",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "First version of my personal portfolio developed in React without typescript.",
			"a": "Developed a static page with the help of React and TailwindCSS",
			"b": "Developed over 10+  custom components",
			"c": "Integrated EmailJS library with a form to contact me",
			"d": "Integrated a language switcher using i18next",
			"e": "Integrated a PDF downloader using @react-pdf/renderer, also supports localization",
			"f": "Statically hosted on an S3 bucket",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "This is a second version of my portfolio developed with NextJS with typescript.",
			"a": "Developed a portfolio/profile website with no backend, utilizing React 18 and TailwindCSS",
			"b": "Designed and implemented custom-made components such as Dialogs, Buttons, LanguageSwitchers, and Spinners",
			"c": "Implemented a small contact form that allows visitors to reach out via Email using the EmailJS library",
			"d": "Integrated a language switcher (FR, EN) using i18next for improved user experience",
			"e": "Implemeted a PDF download option for my curriculum that supports both languages",
			"f": "Set up an S3 bucket to statically host this project under a purchased domain, ensuring secure HTTPS protocol",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "This project is my first ever introduction to React. It was supposed to be an online store with for selling merchandise but the project never finished.",
			"a": "Developed a very small E-Commerce website as a project for friends, although it was never completed. The development involved using React, Redux-Thunk, HTML, CSS, and SCSS",
			"b": "Implemented a fully functional cart system, a basic login system, and a semi-functional PayPal integration for processing payments",
			"c": "Created a backend REST service that seamlessly connects to a SQL database system",
			"d": "Set up migration files to facilitate data initialization during fresh runs, specifically for development purposes",
			"repo": "https://github.com/Sadboiss"
		}
	}
}
