{
	"About": {
		"title": "Little about me",
		"p1": "I'm a software engineer based in Montreal with a passion for solving real-life problems through coding. After briefly pursuing a career in soccer, I realized coding was my true calling. Now, as a full stack engineer at GoTo, I face new challenges daily, and continue working on personal projects in my free time. My competitive mindset, honed from sports, drives my work ethic and passion for development."
	},
	"Introduction": {
		"Web developer, based in Montreal": "Senior Engineer, based in Montreal",
		"I'm a full-stack developer with background experience in building complex platforms and design": "I'm a fullstack developer with background experience in building complex platforms and designs."
	},
	"Index": {
		"About me": "About me",
		"Career timeline": "Career timeline",
		"Projects": "Projects",
		"Skillsets": "Skillsets",
		"Contact": "Contact",
		"Services": "Services"
	},
	"Navbar": {
		"About": "About",
		"Career": "Career",
		"Projects": "Projects",
		"Skillsets": "Skillsets",
		"Contact": "Contact",
		"Download resume": "Download resume"
	},
	"Skills": {
		"title": "Skillsets",
		"Soft": {
			"title": "My soft skills",
			"adaptability": "Quickly adjust to new situations or requirements",
			"communication": "Express ideas clearly and effectively",
			"learning": "Hungry for new knowledge and skills",
			"problemSolving": "Identify and resolve complex issues efficiently",
			"resilience": "Very good at motivating myself because I take joy in coding",
			"teamwork": "Collaborate effectively with others towards common goals"
		},
		"Cloud": {
			"title": "Infrastructure stack",
			"tools": "Used Terraform and Ansible in some projects I run (mostly pickside)",
			"aws": "AWS -> Knows a lot about EC2, ECS, ECR and many more...",
			"google": "GC -> GCC & GCR",
			"experience": "Always trying different tools, and compare cost & services between them",
			"challenges": "Understand cloud cost challenges and always looking for the best way to minimize cost on services"
		},
		"Dev": {
			"title": "Software stack",
			"authentication": "Built my own authentication server for my pickside app project. Great way to learn how it's done.",
			"stack": "I use Go and React/Tailwind/CSS everyday. Also learning C in my free time.",
			"docker": "I use Docker every day for local development + as a deployment tool.",
			"versionning": "I use Git everyday and Github for versionning my projects."
		},
		"Devops": {
			"title": "Devops knowledge",
			"integration": "Worked in several multi-system integration environments",
			"microservices": "Know how to work in a microservice driven project",
			"automation": "Know how to automate a development process using tools like Github actions, Jenkins or Concourse",
			"security": "Understand the importance of security practices such as using a vault storing secrets",
			"commits": "Use semantic commits when coding, drafts release every functionning version",
			"scripts": "Program small scripts that help me in my automation process such as upgrading & commiting a new version for a microservice",
			"containerize": "Containerize my services for easy deployment"
		}
	},
	"Contact": {
		"title": "Contact",
		"Description": "If you are looking for someone to work with or even just to discuss, please feel free to contact me.",
		"Send me an email": "Send me an email"
	},
	"Services": {
		"Starting from": "Starting from {price}$",
		"Design": {
			"title": "Design",
			"a": "A figma design with of how your website will look like",
			"b": "Unlimited calls to go over your design",
			"c": "Fully responsive design",
			"d": "Fully interactable design"
		},
		"SinglePage": {
			"title": "One page",
			"a": "Could be a portfolio to showcase your skills",
			"b": "Could be a blog page that will allow you to post content about your favorite subjects",
			"c": "Could be a restaurant menu",
			"d": "Could be an event promotion website"
		},
		"Custom": {
			"title": "Custom",
			"a": "Unique design",
			"b": "Tailored to your needs & vision",
			"c": "Scalable",
			"d": "Optimized",
			"e": "Will include SEO (Search engine Optimization) to index your website amongst the first results"
		},
		"Inquire": "Inquire"
	},
	"Resume": {
		"View resume": "View resume",
		"Download resume": "Download resume",
		"Resume": "Resume",
		"Frontend": "Frontend",
		"Backend": "Backend",
		"Cloud/DevOps": "Cloud/DevOps",
		"Projects": "Projects",
		"Portfolios": "Portfolios",
		"Personal Projects": "Personal Projects",
		"Custom website": "Custom website",
		"Portfolio": "Portfolio",
		"Service": "Service",
		"E commerce website": "E commerce website",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Senior software engineer",
		"Relevant Experience": "Relevant Experience",
		"Skills": "Skills",
		"Software Engineering": "Software Engineering",
		"Computer Science (Certificate)": "Computer Science (Certificate)",
		"Computer Science & technology": "Computer Science & technology",
		"Bachelor of software engineering": "Bachelor of software engineering",
		"Programming languages": "Programming languages",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Tools & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Rest API application",
		"Selected Projects": "Selected Projects",
		"Education": "Education",
		"Interests": "Interests",
		"Job History": "Job History",
		"Work experience": "Work experience",
		"Senior frontend engineer": "Senior frontend engineer",
		"Fullstack engineer": "Fullstack engineer",
		"Intern frontend engineer": "Intern frontend engineer",
		"Full resume": "Full resume",
		"My information": "My information",
		"Soccer": "Soccer",
		"Hiking": "Hiking",
		"Climbing": "Climbing",
		"Web development": "Web development",
		"Axe throwing": "Axe throwing",
		"Selected projects": "Selected projects",
		"Summary": "Senior fullstack engineer with over 6 years of experience designing, developing, and scaling user-focused platforms. Expertise in leading complex migrations, optimizing performance, and implementing robust, scalable architectures. Proven track record in driving cross-functional collaboration, mentoring teams, and delivering impactful solutions in high-pressure environments.",
		"GoTo": {
			"summary": "I focus on building and enhancing a SaaS business platform, ensuring it’s reliable, user-friendly, and equipped with features that add real value.",
			"a": "Spearheaded the User Sync tool implementation, automating bulk updates with custom rules, enabling 94% migration of legacy users to the new platform.",
			"b": "Designed advanced configuration options in collaboration with cross-functional teams, reducing user onboarding time by 30%.",
			"c": "Re-architected privilege systems to resolve critical access issues, boosting platform reliability and trust.",
			"d": "Built support for billing administrators, enabling 100% user migration from a legacy platform.",
			"e": "Refactored admin features for modularity, improving development speed and maintainability."
		},
		"Desjardins": {
			"summary": "Worked on a secure messaging platform where users could share sensitive documents and messages. Learned a ton about security and building microservices, especially how to make solid REST APIs and pipelines.",
			"a": "Led frontend development with TypeScript and StencilJS, establishing robust coding standards and reusable patterns.",
			"b": "Developed a REST API for secure authentication using Spring Boot and PKCE, supporting microservices architecture.",
			"c": "Delivered 20+ reusable micro-frontend components, enhancing consistency and development efficiency.",
			"d": "Implemented CI/CD pipelines with 80%+ test coverage, streamlining reliable deployments."
		},
		"Bell": {
			"summary": "Helped build an internal dashboard (think JIRA-lite) that made team stand-ups way easier and saved them a ton of time. I also got to work on both the frontend and backend, which was a great learning experience.",
			"a": "Designed a dashboard integrating with an SAP database, reducing team workload by 5 hours per week and boosting productivity by 70%.",
			"b": "Mentored teammates in EmberJS, improving team productivity and technical expertise.",
			"c": "Optimized relational database queries, enhancing performance by 2% in high-load scenarios."
		},
		"Ubisoft": {
			"summary": "This was my first job as an intern, where I fell in love with frontend dev. I built widgets with PolymerJS (a Google library) and learned the ropes of component-based design.",
			"a": "Developed iFrame widgets using PolymerJS and TypeScript, enhancing dashboard communication and user metric tracking.",
			"b": "Contributed to agile development with unit-tested, scalable widgets.",
			"c": "Got hands-on with agile development, which was a great intro to how real teams work.",
			"d": "Wrote unit tests to make sure my widgets were solid and ready to go.",
			"e": "Sat through 100+ meetings and learned a lot about teamwork and communication in a big company."
		},
		"Discord": {
			"summary": "Built a Discord bot with music queue functionality to make things more fun for my friends and me.",
			"a": "Developed a bot using Python and NodeJS, featuring a custom queue system with controls for play, pause, next, and previous.",
			"b": "Set up hosting on an EC2 instance with pm2 to ensure the bot runs 24/7 without interruptions.",
			"c": "Automated the EC2 setup with Ansible and Terraform, saving time and streamlining deployments.",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside is a platform in development for planning sports events, finding teams, and managing venues.",
			"summarywithstack": "Pickside: Event planning app – Built with React, Golang, Docker, AWS, and a home server for hosting and CI/CD.",
			"a": "Developed a scalable event planning app with authentication, role-based functionality, and CRUD operations using React, Golang, and AWS.",
			"b": "Integrated background tasks to support notification dispatch using goroutines, with plans to transition to a real-time notification system.",
			"c": "Designed the platform to support 10,000+ users, ensuring robustness and scalability for future growth.",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "My first portfolio project, built with React to showcase my skills and work.",
			"summarywithstack": "Portfolio V1 - Built with React and TailwindCSS, hosted on AWS via S3.",
			"a": "Built and iterated on a personal portfolio with React and Next.js, adding features like bilingual support, PDF resume downloads, and dynamic functionality.",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "A more polished version of my portfolio, using Next.js and TypeScript for a modern look and feel.",
			"summarywithstack": "Portfolio V2 - Built with Next.js, TypeScript, and TailwindCSS, hosted on Vercel.",
			"a": "Deployed on AWS S3 and Vercel for performance and scalability.",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "An e-commerce store project for selling homemade t-shirts. It was never completed, but I gained valuable experience.",
			"a": "Designed a basic e-commerce site using React 16 (pre-hooks) and a C# backend.",
			"b": "Implemented features like a functional cart, user login, and partial PayPal integration.",
			"c": "Used a home-hosted MySQL server to manage backend data.",
			"d": "Learned about database migrations to streamline development and setup processes.",
			"repo": "https://github.com/Sadboiss"
		}
	}
}