{
	"About": {
		"title": "Un peu sur moi",
		"p1": "Je suis un ingénieur logiciel basé à Montréal, passionné par la résolution de problèmes réels grâce au code. Après avoir brièvement poursuivi une carrière dans le soccer, j'ai réalisé que le développement était ma véritable vocation. Aujourd'hui, en tant qu'ingénieur full stack chez GoTo, je relève quotidiennement de nouveaux défis et je continue à travailler sur des projets personnels pendant mon temps libre. Mon esprit compétitif, forgé par le sport, alimente ma rigueur et ma passion pour le développement."
	},
	"Introduction": {
		"Web developer, based in Montreal": "Ingénieur logiciel sénior, basé à Montréal",
		"I'm a full-stack developer with background experience in building complex platforms and design": "Je suis un développeur full-stack avec une expérience antérieure dans la création de plateformes complexes et de design."
	},
	"Index": {
		"About me": "À propos de moi",
		"Career timeline": "Carrière",
		"Projects": "Projects",
		"Skillsets": "Compétences",
		"Contact": "Contact",
		"Services": "Services"
	},
	"Navbar": {
		"About": "À propos",
		"Career": "Carrière",
		"Projects": "Projets",
		"Services": "Services",
		"Skillsets": "Compétences",
		"Contact": "Contact",
		"Download resume": "Télécharger curriculum"
	},
	"Skills": {
		"title": "Compétences",
		"Soft": {
			"title": "Mes compétences relationnelles",
			"adaptability": "Je m'adapte rapidement à de nouvelles situations ou exigences",
			"communication": "J'exprime mes idées de manière claire et efficace",
			"learning": "Toujours avide de nouvelles connaissances et compétences",
			"problemSolving": "J'identifie et résous les problèmes complexes de manière efficace",
			"resilience": "Très bon pour me motiver car je prends plaisir à coder",
			"teamwork": "Je collabore efficacement avec les autres pour atteindre des objectifs communs"
		},
		"Cloud": {
			"title": "Stack d'infrastructure",
			"tools": "Compétence avec Terraform et Ansible",
			"aws": "AWS -> Je connais bien EC2, ECS, ECR et bien d'autres...",
			"google": "GC -> GCC & GCR",
			"experience": "J'essaie toujours différents outils et compare les coûts et services entre eux",
			"challenges": "Je comprends les défis liés aux coûts du cloud et cherche toujours la meilleure manière de minimiser les coûts des services"
		},
		"Dev": {
			"title": "Stack logicielle",
			"authentication": "J'ai créé mon propre serveur d'authentification pour mon projet d'application Pickside. Une excellente façon d'apprendre comment cela fonctionne.",
			"stack": "J'utilise Go et React/Tailwind/CSS tous les jours. J'apprends aussi le C pendant mon temps libre.",
			"docker": "J'utilise Docker tous les jours pour le développement local et comme outil de déploiement.",
			"versionning": "J'utilise Git tous les jours et Github pour la gestion de version de mes projets."
		},
		"Devops": {
			"title": "Connaissances en Devops",
			"integration": "J'ai travaillé dans plusieurs environnements d'intégration multisystèmes",
			"microservices": "Je sais comment travailler sur un projet piloté par des microservices",
			"automation": "Je sais automatiser un processus de développement à l'aide d'outils comme Github Actions, Jenkins ou Concourse",
			"security": "Je comprends l'importance des pratiques de sécurité, comme l'utilisation d'un coffre pour stocker les secrets",
			"commits": "J'utilise des commits sémantiques lors de la programmation, et je crée des versions fonctionnelles à chaque mise à jour",
			"scripts": "Je programme de petits scripts qui m'aident dans mon processus d'automatisation, tels que la mise à jour et la validation d'une nouvelle version pour un microservice",
			"containerize": "Je conteneurise mes services pour faciliter le déploiement"
		}
	},
	"Contact": {
		"title": "Contact",
		"Description": "Si vous recherchez quelqu'un avec qui travailler ou même simplement pour discuter, n'hésitez pas à me contacter.",
		"Send me an email": "Envoyez-moi un courriel"
	},
	"Services": {
		"Starting from": "À partir de {price} $",
		"Design": {
			"title": "Conception",
			"a": "Une maquette Figma montrant à quoi ressemblera votre site web",
			"b": "Appels illimités pour discuter de votre conception",
			"c": "Conception entièrement responsive",
			"d": "Conception entièrement interactive"
		},
		"SinglePage": {
			"title": "Page unique",
			"a": "Peut être un portfolio pour présenter vos compétences",
			"b": "Peut être une page de blog vous permettant de publier du contenu sur vos sujets préférés",
			"c": "Peut être un menu de restaurant",
			"d": "Peut être un site de promotion d'événement"
		},
		"Custom": {
			"title": "Personnalisé",
			"a": "Conception unique",
			"b": "Adapté à vos besoins et à votre vision",
			"c": "Évolutif",
			"d": "Optimisé",
			"e": "Inclura le référencement SEO (Search Engine Optimization) pour indexer votre site web parmi les premiers résultats"
		},
		"Inquire": "Demander"
	},
	"Resume": {
		"View resume": "Voir curriculum",
		"Download resume": "Télécharger curriculum",
		"Resume": "Curriculum",
		"Frontend": "Frontend",
		"Backend": "Backend",
		"Cloud/DevOps": "Cloud/DevOps",
		"Projects": "Projets",
		"Portfolios": "Portfolios",
		"Personal Projects": "Projets personnels",
		"Portfolio": "Portfolio",
		"E commerce website": "Page de commerce",
		"Custom website": "Page personnalisé",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Senior software engineer",
		"Relevant Experience": "Expérience Pertinente",
		"Skills": "Compétences",
		"Selected Projects": "Projets Sélectionnés",
		"Education": "Éducation",
		"Software Engineering": "Ingénieur logiciel",
		"Computer Science (Certificate)": "Science de l'info (Certificat)",
		"Computer Science & technology": "Science de l'info & technology",
		"Bachelor of software engineering": "Baccalauréat en génie logiciel",
		"Programming languages": "Langages de prog",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Outils & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Application REST",
		"Interests": "Centres d'intérêt",
		"Job History": "Historique professionnel",
		"Work experience": "Expérience professionnelle",
		"Senior frontend engineer": "Ingénieur frontend senior",
		"Fullstack engineer": "Ingénieur fullstack",
		"Intern frontend engineer": "Stagiaire ingénieur frontend",
		"Full resume": "Plein résumé",
		"My information": "Mes informations",
		"Soccer": "Soccer",
		"Hiking": "Randonnée",
		"Climbing": "Escalade",
		"Web development": "Développement",
		"Axe throwing": "Lancer de hache",
		"Selected projects": "Projets sélectionnés",
		"Summary": "Ingénieur fullstack senior avec plus de 6 ans d'expérience dans la conception, le développement et la mise à l'échelle de plateformes centrées sur l'utilisateur. Expertise dans la conduite de migrations complexes, l'optimisation des performances et la mise en œuvre d'architectures robustes et évolutives. Historique prouvé en matière de collaboration interfonctionnelle, de mentorat d'équipes et de livraison de solutions impactantes dans des environnements sous pression.",
		"GoTo": {
			"summary": "Je me concentre sur la construction et l'amélioration d'une plateforme SaaS pour les entreprises, en veillant à ce qu'elle soit fiable, conviviale et dotée de fonctionnalités qui apportent une réelle valeur ajoutée.",
			"a": "Dirigé la mise en œuvre de l'outil User Sync, automatisant les mises à jour groupées avec des règles personnalisées, permettant la migration de 94 % des utilisateurs hérités vers la nouvelle plateforme.",
			"b": "Conçu des options de configuration avancées en collaboration avec des équipes interfonctionnelles, réduisant le temps d'intégration des utilisateurs de 30 %.",
			"c": "Réarchitecturé les systèmes de privilèges pour résoudre des problèmes d'accès critiques, augmentant la fiabilité et la confiance dans la plateforme.",
			"d": "Mis en place un support pour les administrateurs de facturation, permettant la migration de 100 % des utilisateurs depuis une plateforme héritée.",
			"e": "Refactorisé les fonctionnalités administratives pour plus de modularité, améliorant la vitesse de développement et la maintenabilité."
		},
		"Desjardins": {
			"summary": "J'ai travaillé sur une plateforme de messagerie sécurisée permettant aux utilisateurs de partager des documents et messages sensibles. J'ai beaucoup appris sur la sécurité et la création de microservices, en particulier sur la façon de concevoir des API REST solides et des pipelines efficaces.",
			"a": "Dirigé le développement frontend avec TypeScript et StencilJS, établissant des normes de codage robustes et des modèles réutilisables.",
			"b": "Développé une API REST pour l'authentification sécurisée avec Spring Boot et PKCE, prenant en charge une architecture de microservices.",
			"c": "Livré plus de 20 composants micro-frontend réutilisables, améliorant la cohérence et l'efficacité du développement.",
			"d": "Mis en œuvre des pipelines CI/CD avec une couverture de tests de plus de 80 %, facilitant des déploiements fiables."
		},
		"Bell": {
			"summary": "J'ai contribué à la création d'un tableau de bord interne (semblable à JIRA-lite) qui a considérablement simplifié les stand-ups d'équipe et leur a fait gagner beaucoup de temps. J'ai également travaillé sur le frontend et le backend, ce qui a été une excellente expérience d'apprentissage.",
			"a": "Conçu un tableau de bord intégré à une base de données SAP, réduisant la charge de travail de l'équipe de 5 heures par semaine et augmentant la productivité de 70 %.",
			"b": "Encadré des coéquipiers sur EmberJS, améliorant la productivité de l'équipe et leur expertise technique.",
			"c": "Optimisé les requêtes des bases de données relationnelles, améliorant les performances de 2 % dans des scénarios de forte charge."
		},
		"Ubisoft": {
			"summary": "Il s'agissait de mon premier emploi en tant que stagiaire, où je suis tombé amoureux du développement frontend. J'ai créé des widgets avec PolymerJS (une bibliothèque de Google) et appris les bases de la conception orientée composants.",
			"a": "Développé des widgets iFrame avec PolymerJS et TypeScript, améliorant la communication et le suivi des métriques utilisateurs du tableau de bord.",
			"b": "Contribué au développement agile avec des widgets évolutifs et testés unitairement.",
			"c": "Mis en pratique les méthodologies agiles, une excellente introduction au travail d'équipe réel.",
			"d": "Rédigé des tests unitaires pour garantir la robustesse et la préparation des widgets.",
			"e": "Assisté à plus de 100 réunions, apprenant beaucoup sur le travail en équipe et la communication dans une grande entreprise."
		},
		"Discord": {
			"summary": "Créé un bot Discord avec des fonctionnalités de file d'attente musicale pour rendre les choses plus amusantes pour mes amis et moi.",
			"a": "Développé un bot avec Python et NodeJS, intégrant un système de file d'attente personnalisé avec des contrôles pour lire, mettre en pause, passer et revenir en arrière.",
			"b": "Hébergé sur une instance EC2 avec pm2 pour garantir un fonctionnement continu 24h/24 et 7j/7.",
			"c": "Automatisé la configuration EC2 avec Ansible et Terraform, économisant du temps et simplifiant les déploiements.",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside est une plateforme en développement pour organiser des événements sportifs, trouver des équipes et gérer des terrains.",
			"summarywithstack": "Pickside : Application de planification d'événements – Conçue avec React, Golang, Docker, AWS et un serveur personnel pour l'hébergement et le CI/CD.",
			"a": "Développé une application de planification d'événements évolutive avec authentification, fonctionnalités basées sur les rôles et opérations CRUD utilisant React, Golang et AWS.",
			"b": "Intégré des tâches en arrière-plan pour gérer l'envoi de notifications avec des goroutines, avec des plans de transition vers un système de notifications en temps réel.",
			"c": "Conçu la plateforme pour prendre en charge plus de 10 000 utilisateurs, garantissant robustesse et évolutivité pour une croissance future.",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "Mon premier projet de portfolio, conçu avec React pour mettre en valeur mes compétences et mon travail.",
			"summarywithstack": "Portfolio V1 - Construit avec React et TailwindCSS, hébergé sur AWS via S3.",
			"a": "Conçu et itéré sur un portfolio personnel avec React et Next.js, ajoutant des fonctionnalités comme le support bilingue, le téléchargement de CV en PDF et des fonctionnalités dynamiques.",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "Une version plus aboutie de mon portfolio, utilisant Next.js et TypeScript pour un design moderne et soigné.",
			"summarywithstack": "Portfolio V2 - Construit avec Next.js, TypeScript et TailwindCSS, hébergé sur Vercel.",
			"a": "Déployé sur AWS S3 et Vercel pour des performances et une évolutivité optimales.",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "Un projet de boutique en ligne pour vendre des t-shirts faits maison. Il n'a jamais été achevé, mais j'y ai acquis une expérience précieuse.",
			"a": "Conçu un site de commerce électronique de base en utilisant React 16 (avant les hooks) et un backend en C#.",
			"b": "Implémenté des fonctionnalités telles qu'un panier fonctionnel, une connexion utilisateur et une intégration partielle de PayPal.",
			"c": "Utilisé un serveur MySQL hébergé chez moi pour gérer les données backend.",
			"d": "Appris les migrations de bases de données pour simplifier les processus de développement et de configuration.",
			"repo": "https://github.com/Sadboiss"
		}
	}
}