{
	"About": {
		"title": "Un peu sur moi",
		"p1": "Salut :) Je m'appelle Antoine et je prends plaisir à créer du contenu pour moi-même en tant que passe-temps. Je n'ai jamais travaillé pour un client de manière indépendante, mais j'attends avec impatience ce jour. Quoi qu'il en soit, j'ai 29 ans et je suis basé à Montréal, Canada. J'étais très passionné par le sport quand j'étais encore à l'école. Tellement passionné que j'ai essayé de devenir professionnel. Cependant, il m'a fallu un certain temps pour comprendre que je voulais consacrer ma vie à devenir plus entrepreneur.",
		"p2": "Je me suis intéressé au développement web lors d'un de mes stages et me voilà aujourd'hui, toujours passionné par ce domaine. Je travaille actuellement chez",
		"p3": "en tant que développeur frontend. Je suis constamment confronté à de nouvelles contraintes chaque semaine et je suis fier et heureux du travail que j'accomplis.",
		"p4": "Mon objectif ultime est d'avoir une maison immense avec un terrain de football dans mon jardin, et ce jour viendra avec des efforts. Mais ne vous inquiétez pas, je suis très terre à terre et j'apprécie le chemin vers cette montagne."
	},
	"Introduction": {
		"hi": "Salut,",
		"intro": "Salut, mon nom est",
		"name": "Antoine Hakim.",
		"jobTitle": "Développeur web, situe a Montreal",
		"summary": "Je suis un développeur full-stack avec une solide expérience dans la création de plateformes sur mesure, spécialement conçues pour répondre aux besoins des clients. Mes réussites passées se sont déroulées au sein des entreprises où j'ai travaillé. En ce moment, je suis à la recherche de nouvelles connexions et j'adorerais collaborer avec vous pour concevoir du contenu incroyable. Si vous avez un projet que vous aimeriez concrétiser, je suis la personne idéale pour vous aider !"
	},
	"Index": {
		"About me": "À propos de moi",
		"Career timeline": "Carrière",
		"Projects": "Projects",
		"My offers": "Mes services"
	},
	"Navbar": {
		"About": "À propos",
		"Career": "Carrière",
		"Projects": "Projets",
		"Services": "Services",
		"Download": "Résumé",
		"Filename": "CV_Antoine_Hakim_Fr"
	},
	"Services": {
		"Services": "Services",
		"What's included": "Ce qui est inclue",
		"One page": "Une page",
		"Custom website": "Personnalisé",
		"Design": "Design",
		"Inquire": "S'informer"
	},
	"Resume": {
		"Resume": "Curriculum",
		"Projects": "Projets",
		"Personal projects": "Projects personnel",
		"Portfolio": "Portfolio",
		"E commerce website": "Page de commerce",
		"Custom website": "Page personnalisé",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Ingénieur full-stack expérimenté axé sur la création d'expériences accessibles et personnalisées",
		"Relevant Experience": "Expérience Pertinente",
		"Skills": "Compétences",
		"Selected Projects": "Projets Sélectionnés",
		"Education": "Éducation",
		"Software Engineering": "Ingénieur logiciel",
		"Computer Science (Certificate)": "Science de l'info (Certificat)",
		"Computer Science & technology": "Science de l'info & technology",
		"Bachelor of software engineering": "Baccalauréat en génie logiciel",
		"Programming languages": "Langages de prog",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Outils & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Application REST",
		"Interests": "Centres d'intérêt",
		"Job History": "Historique professionnel",
		"Work experience": "Expérience professionnelle",
		"Senior Frontend Engineer": "Ingénieur Frontend Senior",
		"Fullstack engineer": "Ingénieur Fullstack",
		"Intern Frontend developer": "Développeur Frontend en stage",
		"Full resume": "Plein résumé",
		"My information": "Mes informations",
		"Soccer": "Soccer",
		"Hiking": "Randonnée",
		"Climbing": "Escalade",
		"Web development": "Développement",
		"Axe throwing": "Lancer de hache",
		"Selected projects": "Projets sélectionnés",
		"GoTo": {
			"summary": "Je contribue au développement d'un outil de communication d'entreprise SaaS de premier ordre, en mettant l'accent sur les fonctionnalités orientées client. Mon travail garantit que la plateforme reste de haute qualité et robuste, offrant une expérience fluide aux utilisateurs.",
			"a": "Développé un outil haut de gamme de communication d'entreprise en utilisant ReactJS, Redux-Thunk, React-Router, Javascript, Typescript, HTML5, CSS3 et MUI5",
			"b": "Construit et géré des composants personnalisés pour des librairies internes",
			"c": "Exclusivement utilisé les React-Hooks pour gérer les processus du cycle de vie de l'application",
			"d": "Collaboré avec l'équipe UI/UX pour établir les spécifications et les conceptions du système",
			"e": "Travaillé selon des méthodologies agiles pour un développement itératif afin de fournir constamment une meilleure application",
			"f": "Possède une expertise solide sur Github (anciennement utilisé Bitbucket)",
			"g": "Créé des fonctionnalités/sections/sous-sections pour la nouvelle application web (codée en React) en utilisant une approche micro-frontend",
			"h": "Développé des fonctionnalités qui ont facilité une transition fluide pour 90% des clients utilisant l'application web de la plateforme héritée vers l'application web plus moderne, entraînant une expérience utilisateur nettement améliorée"
		},
		"Desjardins": {
			"summary": "Contribué au développement d'une plateforme de messagerie sécurisée à usage interne avec des clients externes, où les deux parties peuvent partager des documents, envoyer et recevoir des messages ainsi que d'autres fonctionnalités. Travailler là-bas m'a également donné une expérience pratique de la gestion de la sécurité car c'était une banque, et les informations sont extrêmement sensibles. Le backend fonctionnait selon une approche de microservices et j'étais responsable de l'un d'eux, j'ai donc appris à développer un backend REST avec SpringBoot et acquis beaucoup d'expérience avec le déploiement continu.",
			"a": "Dirigé le développement et introduit des normes rigoureuses de codage pour notre application frontend en Typescript en utilisant StencilJS",
			"b": "Développé un service frontend à partir de zéro en utilisant AngularJS, StencilJS, Typescript, HTML5 et CSS/SCSS",
			"c": "Aidé à développer un service RESTful à partir de zéro, en utilisant une approche de microservices pour de meilleures performances avec l'aide de SpringBoot et de bibliothèques telles que PKCE pour une authentification sécurisé",
			"d": "Configuré des pipelines automatisés Concourse/CI qui récupèrent un projet, effectuent une construction, exécutent des tests unitaires, des tests de fumée et le déploiement sur plusieurs environnements (dev, stage et production)",
			"e": "Développé des tests unitaires en utilisant JUnit5 et JaCoCo pour Spring Boot, et Jest pour Stencil",
			"f": "Connecté nos référentiels à notre serveur dédié SonarQube et ajouté un test de couverture de 80% avec des seuils de duplication de 5% pour le succès (à la fois pour le backend et le frontend)"
		},
		"Bell": {
			"summary": "Dirigé le développement d'un tableau de bord fonctionnel similaire à JIRA pour aider les employés internes lors de leurs réunions matinales. Mon travail a eu un impact sur leurs horaires et leur a permis d'être 70 % plus productifs chaque jour. J'ai pris en charge la mise en place de la structure du code et, avec mes modestes connaissances en EmberJS à l'époque, j'ai utilisé ce que j'avais. J'ai également eu l'occasion de travailler sur le backend REST qui était développé en C#.",
			"a": "Construit un tableau de bord entièrement fonctionnel similaire à JIRA à partir de zéro en utilisant EmberJS et le framework Ember Octane, ainsi que HTML, JavaScript et CSS, pour que les équipes internes puissent l'utiliser lors de leurs standups",
			"b": "Introduit une conception de code bien structurée avec des composants modulaires et réutilisables à travers l'application",
			"c": "Encadré des stagiaires sur l'utilisation d'EmberJS",
			"d": "Travaillé avec l'équipe backend pour développer des endpoints pour des cas d'utilisation spécifiques requis par les clients en utilisant C# avec certains modèles de conception bien connus tels que la OOP et le polymorphisme",
			"e": "Suivi des pratiques de développement agile et utilisé Bitbucket/JIRA pour le suivi des bugs"
		},
		"Discord": {
			"summary": "J'ai développé un bot Discord avec une fonctionnalité de file d'attente musicale, pour mes amis et moi.",
			"a": "Développé un bot Discord qui joue de la musique pour mon groupe d'amis en utilisant NodeJS, intégrant un système de file d'attente sur mesure avec des fonctionnalités telles que précédent, pause, lecture et suivant. Cette implémentation a utilisé des bibliothèques préconstruites telles que Discord.js 13 et ytdl pour jouer de la musique depuis YouTube",
			"b": "Configuré une instance de serveur EC2 pour héberger mon bot Discord en utilisant un package de bibliothèque préconstruite appelé pm2, qui exécute efficacement les projets Node en tant que processus, permettant ainsi au bot de fonctionner 24/7",
			"c": "Exploré Ansible et Terraform en tant que passe-temps pour acquérir des compétences en automatisation, ce qui m'a permis d'automatiser avec succès le processus de configuration d'un serveur EC2 avec tous les packages nécessaires pour exécuter le bot Discord",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside est une application encore en développement. Elle vise à être une plateforme où les gens peuvent planifier des événements sportifs sur des terrains extérieurs/intérieurs, trouver des équipes et des groupes pour jouer ensemble.",
			"a": "Développé une application web de gestion d'événements sportifs qui permet aux utilisateurs de planifier des activités de plein air liées aux sports en utilisant ReactJS, Redux-Thunk, TailwindCSS et HTML",
			"b": "Créé un backend de service RESTful en utilisant NodeJS/ExpressJS et Mongoose, qui se connecte à un serveur MongoDB pour le stockage des données",
			"c": "Implémenté un système d'authentification à l'aide de la bibliothèque JWT, permettant aux utilisateurs de se connecter au backend avec un accessToken (actuellement valable 1 minute) et un refreshToken",
			"d": "Intégré un serveur Swagger à des fins de documentation",
			"e": "Mis en place une option d'authentification de connexion Google, permettant aux utilisateurs de se connecter avec leurs comptes Google",
			"f": "Créé des composants réutilisables sur mesure tels que TextField, Accordion, Stepper, Toast, Calendar et Timepicker",
			"g": "Utilisé exclusivement React-Hooks pour gérer les processus du cycle de vie de l'application",
			"h": "Développé des middlewares sur mesure pour intercepter les envois et exécuter certaines logiques",
			"i": "Utilisé la bibliothèque Google's Places API pour connecter une carte et rechercher des emplacements",
			"j": "Utilisé la fonction native de géolocalisation de HTML pour demander l'emplacement de l'utilisateur, de sorte que la carte se centre et zoome sur sa zone lors du chargement",
			"k": "Mis en place un sélecteur de langue et un sélecteur de thème",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "La première version de mon portfolio personnel a été développée en React sans TypeScript.",
			"a": "Développé un site web de portfolio/profil sans backend en utilisant React 18 et TailwindCSS",
			"b": "Conçu et implémenté des composants sur mesure tels que des Dialogues, des Boutons, des Sélecteurs de Langue et des Indicateurs de Chargement (Spinners)",
			"c": "Mis en place un petit formulaire permettant aux visiteurs de me contacter par e-mail en utilisant la bibliothèque EmailJS",
			"d": "Mis en place un sélecteur de langue (FR, EN) en utilisant i18next pour une meilleure expérience utilisateur.",
			"e": "Fourni une option de téléchargement PDF pour mon curriculum qui prend en charge les deux langues",
			"f": "Configuré un bucket S3 pour héberger statiquement ce projet sous un domaine acheté, en assurant un protocole HTTPS sécurisé",
			"g": "Acquis une meilleure connaissance de l'utilisation des commandes aws-cli",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "Il s'agit d'une deuxième version de mon portfolio développée avec NextJS.",
			"a": "Developed a portfolio/profile website with no backend, utilizing React 18 and TailwindCSS",
			"b": "Designed and implemented custom-made components such as Dialogs, Buttons, LanguageSwitchers, and Spinners",
			"c": "Implemented a small contact form that allows visitors to reach out via Email using the EmailJS library",
			"d": "Integrated a language switcher (FR, EN) using i18next for improved user experience",
			"e": "Implemeted a PDF download option for my curriculum that supports both languages",
			"f": "Set up an S3 bucket to statically host this project under a purchased domain, ensuring secure HTTPS protocol",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "Ce projet est ma toute première introduction à React. Il était censé être une boutique en ligne pour vendre des produits dérivés, mais le projet n'a jamais été terminé.",
			"a": "Développé un très petit site web de commerce électronique en tant que projet pour des amis, bien qu'il n'ait jamais été terminé à l'aide de React, Redux-Thunk, HTML, CSS et SCSS",
			"b": "Implémenté un système de panier fonctionnel, un système de connexion basique et une intégration PayPal semi-fonctionnel pour le traitement des paiements",
			"c": "Créé un service backend REST qui se connecte de manière transparente à un système de base de données SQL",
			"d": "Mis en place des fichiers de migration pour faciliter l'initialisation des données lors de nouvelles exécutions, spécifiquement à des fins de développement",
			"repo": "https://github.com/Sadboiss"
		}
	}
}
