{
	"About": {
		"title": "Un peu sur moi",
		"p1": "Salut ! 😊 Je suis Antoine et j'adore créer du contenu en tant que passe-temps. Même si je n'ai pas encore eu l'occasion de travailler de manière indépendante pour des clients, j'attends avec impatience cette opportunité. J'ai 29 ans et je suis fier d'appeler Montréal, Canada, chez moi (et oui, je parle français !).",
		"p2": "À l'école, j'étais passionné par le sport et rêvais même de devenir professionnel. Cependant, au fil du temps, j'ai réalisé que ma véritable vocation était l'entrepreneuriat.",
		"p3": "Mon parcours dans le développement web a commencé pendant l'un de mes stages, et me voici aujourd'hui, toujours complètement passionné par cela. Actuellement, je suis développeur frontend chez {company}, où je suis confronté à de nouveaux défis chaque semaine. Je suis extrêmement fier et heureux du travail que je fais, c'est vraiment gratifiant !"
	},
	"Introduction": {
		"Web developer, based in Montreal": "Développeur web, basé à Montréal",
		"I'm a full-stack developer with background experience in building complex platforms and design": "Je suis un développeur full-stack avec une expérience antérieure dans la création de plateformes complexes et de design."
	},
	"Index": {
		"About me": "À propos de moi",
		"Career timeline": "Carrière",
		"Projects": "Projects",
		"My packages": "Mes services"
	},
	"Navbar": {
		"About": "À propos",
		"Career": "Carrière",
		"Projects": "Projets",
		"Services": "Services",
		"Download": "Résumé"
	},
	"Services": {
		"Starting from": "À partir de {price} $",
		"Design": {
			"title": "Conception",
			"a": "Une maquette Figma montrant à quoi ressemblera votre site web",
			"b": "Appels illimités pour discuter de votre conception",
			"c": "Conception entièrement responsive",
			"d": "Conception entièrement interactive"
		},
		"SinglePage": {
			"title": "Page unique",
			"a": "Peut être un portfolio pour présenter vos compétences",
			"b": "Peut être une page de blog vous permettant de publier du contenu sur vos sujets préférés",
			"c": "Peut être un menu de restaurant",
			"d": "Peut être un site de promotion d'événement"
		},
		"Custom": {
			"title": "Personnalisé",
			"a": "Conception unique",
			"b": "Adapté à vos besoins et à votre vision",
			"c": "Évolutif",
			"d": "Optimisé",
			"e": "Inclura le référencement SEO (Search Engine Optimization) pour indexer votre site web parmi les premiers résultats"
		},
		"Inquire": "Demander"
	},
	"Resume": {
		"View resume": "Voir curriculum",
		"Resume": "Curriculum",
		"Projects": "Projets",
		"Personal projects": "Projects personnel",
		"Portfolio": "Portfolio",
		"E commerce website": "Page de commerce",
		"Custom website": "Page personnalisé",
		"Antoine Hakim": "Antoine Hakim",
		"Role": "Ingénieur full-stack expérimenté axé sur la création d'expériences accessibles et personnalisées",
		"Relevant Experience": "Expérience Pertinente",
		"Skills": "Compétences",
		"Selected Projects": "Projets Sélectionnés",
		"Education": "Éducation",
		"Software Engineering": "Ingénieur logiciel",
		"Computer Science (Certificate)": "Science de l'info (Certificat)",
		"Computer Science & technology": "Science de l'info & technology",
		"Bachelor of software engineering": "Baccalauréat en génie logiciel",
		"Programming languages": "Langages de prog",
		"Libraries & Frameworks": "Libraries & Frameworks",
		"Tools and platforms": "Outils & platforms",
		"Vanier College": "Vanier College",
		"Rest API application": "Application REST",
		"Interests": "Centres d'intérêt",
		"Job History": "Historique professionnel",
		"Work experience": "Expérience professionnelle",
		"Senior frontend engineer": "Ingénieur frontend senior",
		"Fullstack engineer": "Ingénieur fullstack",
		"Intern frontend engineer": "Stagiaire ingénieur frontend",
		"Full resume": "Plein résumé",
		"My information": "Mes informations",
		"Soccer": "Soccer",
		"Hiking": "Randonnée",
		"Climbing": "Escalade",
		"Web development": "Développement",
		"Axe throwing": "Lancer de hache",
		"Selected projects": "Projets sélectionnés",
		"GoTo": {
			"summary": "Je contribue au développement d'un outil de communication professionnelle SaaS de premier plan, en mettant l'accent sur les fonctionnalités orientées client. Mon travail garantit que la plateforme reste de haute qualité et robuste, offrant une expérience fluide aux utilisateurs.",
			"a": "Développé et modifié 10+ fonctionnalités principales, aidant 85 % des clients existants à abandonner l'ancienne plateforme d'une entreprise qui vaut $4B",
			"b": "Développé 20+ composants réutilisables",
			"c": "Pris l'initiative d'ajouter un sprint de refactoring pour raccourcir progressivement l'écart de dette de code",
			"d": "Collaboration constante avec l'équipe UI/UX pour établir des spécifications et des conceptions système",
			"e": "Supervisé la revue et les normes de codage des nouvelles fonctionnalités",
			"f": "Documenté le flux de conception et les aspects techniques des nouvelles fonctionnalités, ainsi que suivi de leur progression",
			"g": "Présenté et transmis des idées et des approches de conception avec 3 partenaires UX et 2 ingénieurs responsables",
			"h": "Construit de petits scripts automatisés pour aider mon processus de déploiement de fonctionnalités, augmentant ma productivité de 10%"
		},
		"Desjardins": {
			"summary": "Contribué au développement d'une plateforme de messagerie sécurisée à usage interne avec des clients externes, où les deux parties peuvent partager des documents, envoyer et recevoir des messages ainsi que d'autres fonctionnalités. Travailler là-bas m'a également donné une expérience pratique de la gestion de la sécurité, car il s'agissait d'une banque et les informations étaient extrêmement sensibles. Le backend fonctionnait selon une approche de microservice et j'étais responsable de l'un d'entre eux, j'ai donc appris à développer un backend REST avec SpringBoot et acquis beaucoup d'expérience dans le déploiement de pipeline.",
			"a": "Dirigé le développement et introduit des normes de codage rigoureuses pour l'application frontend en utilisant TypeScript et StencilJS",
			"b": "Développé des microservices frontend, avec chacun 20+ composants réutilisables personnalisés",
			"c": "Développé l'un des 3 microservices Rest APIs utilisés pour le service d'authentification de la plateforme en utilisant Spring et PKCE",
			"d": "Configuré un pipeline de déploiement pour chaque microservice que j'ai développé, et ajouté un contrôle de qualité avec un seuil de réussite des tests de 80% pour le BFF",
			"e": "Développé des tests unitaires et d'intégration en utilisant JUnit5/JaCoCo pour le backend, et Jest/Puppeteer pour Stencil"
		},
		"Bell": {
			"summary": "Dirigé le développement d'un tableau de bord entièrement fonctionnel similaire à JIRA, aidant les employés internes lors de leurs réunions matinales. Mon travail a eu un impact sur leurs horaires et leur a permis d'être 70 % plus productifs chaque jour. J'ai pris en charge la structure du code en utilisant ce que je connaissais à l'époque, une connaissance très limitée d'EmberJS. J'ai également eu l'opportunité de travailler sur le backend REST qui a été développé en C#.",
			"a": "Construit un tableau de bord interne entièrement fonctionnel connecté à une base de données SAP, aidant les équipes sur site à augmenter leur productivité de 70 % et leur permettant d'économiser 5 heures chaque semaine",
			"b": "Introduit une structure de conception solide orientée composant, améliorant l'efficacité des développeurs travaillant sur le code",
			"c": "Encadré des stagiaires et des seniors sur EmberJS",
			"d": "Aidé à optimiser une grande base de données relationnelle pilotée par une logique métier complexe et réduit le nombre de requêtes nécessaires de 2%",
			"e": "Déployé 30+ fonctionnalités suivant la pratique de développement agile"
		},
		"Ubisoft": {
			"summary": "Ubisoft était mon premier emploi, en tant que stagiaire, et c'est également là que j'ai découvert mon amour pour le développement frontend. J'étais responsable du développement de certains widgets avec PolymerJS, une bibliothèque de composants Web développée par Google. J'ai utilisé ma connaissance presque inexistante de l'approche de conception de composants (à l'époque) pour apprendre et créer mon premier widget.",
			"a": "Construit un widget iFrame entièrement fonctionnel qui peut recevoir et envoyer des événements depuis le tableau de bord auquel il est attaché en utilisant PolymerJS et Typescript",
			"b": "Construit 2+ widgets connectés à un tableau de bord principalement pour les métriques utilisateur",
			"c": "Appris le processus de développement agile et l'ai mis en pratique",
			"d": "Développé des tests unitaires",
			"e": "Participé à 100+ réunions pendant mon stage"
		},
		"Discord": {
			"summary": "J'ai développé un bot Discord avec une fonctionnalité de file d'attente musicale, pour mes amis et moi.",
			"a": "Développé un bot Discord qui joue de la musique pour mon groupe d'amis en utilisant NodeJS, intégrant un système de file d'attente sur mesure avec des fonctionnalités telles que précédent, pause, lecture et suivant. Cette implémentation a utilisé des bibliothèques préconstruites telles que Discord.js 13 et ytdl pour jouer de la musique depuis YouTube",
			"b": "Configuré une instance de serveur EC2 pour héberger mon bot Discord en utilisant un package de bibliothèque préconstruite appelé pm2, qui exécute efficacement les projets Node en tant que processus, permettant ainsi au bot de fonctionner 24/7",
			"c": "Exploré Ansible et Terraform en tant que passe-temps pour acquérir des compétences en automatisation, ce qui m'a permis d'automatiser avec succès le processus de configuration d'un serveur EC2 avec tous les packages nécessaires pour exécuter le bot Discord",
			"repo": "https://github.com/thenoobgrammer/bramble"
		},
		"Pickside": {
			"summary": "Pickside est une application encore en développement. Elle vise à être une plateforme où les gens peuvent planifier des événements sportifs sur des terrains extérieurs/intérieurs, trouver des équipes et des groupes pour jouer ensemble.",
			"a": "Développé une application web de gestion d'événements sportifs qui permet aux utilisateurs de planifier des activités de plein air liées aux sports en utilisant ReactJS, Redux-Thunk, TailwindCSS et HTML",
			"b": "Créé un backend de service RESTful en utilisant NodeJS/ExpressJS et Mongoose, qui se connecte à un serveur MongoDB pour le stockage des données",
			"c": "Implémenté un système d'authentification à l'aide de la bibliothèque JWT, permettant aux utilisateurs de se connecter au backend avec un accessToken (actuellement valable 1 minute) et un refreshToken",
			"d": "Intégré un serveur Swagger à des fins de documentation",
			"e": "Mis en place une option d'authentification de connexion Google, permettant aux utilisateurs de se connecter avec leurs comptes Google",
			"f": "Créé des composants réutilisables sur mesure tels que TextField, Accordion, Stepper, Toast, Calendar et Timepicker",
			"g": "Utilisé exclusivement React-Hooks pour gérer les processus du cycle de vie de l'application",
			"h": "Développé des middlewares sur mesure pour intercepter les envois et exécuter certaines logiques",
			"i": "Utilisé la bibliothèque Google's Places API pour connecter une carte et rechercher des emplacements",
			"j": "Utilisé la fonction native de géolocalisation de HTML pour demander l'emplacement de l'utilisateur, de sorte que la carte se centre et zoome sur sa zone lors du chargement",
			"k": "Mis en place un sélecteur de langue et un sélecteur de thème",
			"repo": "https://github.com/PickSide",
			"website": "https://pickside.net"
		},
		"PortfolioV1": {
			"summary": "La première version de mon portfolio personnel a été développée en React sans TypeScript.",
			"a": "Développé un site web de portfolio/profil sans backend en utilisant React 18 et TailwindCSS",
			"b": "Conçu et implémenté des composants sur mesure tels que des Dialogues, des Boutons, des Sélecteurs de Langue et des Indicateurs de Chargement (Spinners)",
			"c": "Mis en place un petit formulaire permettant aux visiteurs de me contacter par e-mail en utilisant la bibliothèque EmailJS",
			"d": "Mis en place un sélecteur de langue (FR, EN) en utilisant i18next pour une meilleure expérience utilisateur.",
			"e": "Fourni une option de téléchargement PDF pour mon curriculum qui prend en charge les deux langues",
			"f": "Configuré un bucket S3 pour héberger statiquement ce projet sous un domaine acheté, en assurant un protocole HTTPS sécurisé",
			"g": "Acquis une meilleure connaissance de l'utilisation des commandes aws-cli",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"PortfolioV2": {
			"summary": "Il s'agit d'une deuxième version de mon portfolio développée avec NextJS.",
			"a": "Developed a portfolio/profile website with no backend, utilizing React 18 and TailwindCSS",
			"b": "Designed and implemented custom-made components such as Dialogs, Buttons, LanguageSwitchers, and Spinners",
			"c": "Implemented a small contact form that allows visitors to reach out via Email using the EmailJS library",
			"d": "Integrated a language switcher (FR, EN) using i18next for improved user experience",
			"e": "Implemeted a PDF download option for my curriculum that supports both languages",
			"f": "Set up an S3 bucket to statically host this project under a purchased domain, ensuring secure HTTPS protocol",
			"g": "Gained a comprehensive understanding of using aws-cli commands",
			"repo": "https://github.com/thenoobgrammer/my-portfolio"
		},
		"Sadbois": {
			"summary": "Ce projet est ma toute première introduction à React. Il était censé être une boutique en ligne pour vendre des produits dérivés, mais le projet n'a jamais été terminé.",
			"a": "Développé un très petit site web de commerce électronique en tant que projet pour des amis, bien qu'il n'ait jamais été terminé à l'aide de React, Redux-Thunk, HTML, CSS et SCSS",
			"b": "Implémenté un système de panier fonctionnel, un système de connexion basique et une intégration PayPal semi-fonctionnel pour le traitement des paiements",
			"c": "Créé un service backend REST qui se connecte de manière transparente à un système de base de données SQL",
			"d": "Mis en place des fichiers de migration pour faciliter l'initialisation des données lors de nouvelles exécutions, spécifiquement à des fins de développement",
			"repo": "https://github.com/Sadboiss"
		}
	}
}
